{
    "myuplink adapter settings": "Ajustes del adaptador para myuplink",
    "Authentication": "Autenticación",
    "Get it from https://dev.myuplink.com/apps": "Consíguelo en https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Utilizar Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "Estas y las siguientes opciones no son necesarias en la mayoría de los casos.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "No es necesario cambiarlo. Puede utilizar https://sebilm.github.io/ioBroker.myuplink/myuplink.html",
    "Click here to generate the Auth Code on myUplink.": "Haga clic aquí para generar el Auth Code en myUplink.",
    "Paste your Auth Code here.": "Pegue aquí su Auth Code.",
    "Settings": "Ajustes",
    "Refresh interval": "Intervalo de actualización",
    "Time in minutes of fetching data from myUplink.": "Tiempo en minutos de obtención de datos de myUplink.",
    "Language": "Idioma",
    "English": "Inglés",
    "German": "Alemán",
    "Swedish": "sueco",
    "The language for naming the data objects.": "El lenguaje para nombrar los objetos de datos.",
    "Parameter data": "Datos de parámetros",
    "Retrieve parameter data": "Recuperar datos de parámetros",
    "Parameter data will be retrieved and added to the object tree.": "Los datos de los parámetros se recuperarán y agregarán al árbol de objetos.",
    "Add object with the raw JSON data": "Agregar objeto con los datos JSON sin procesar",
    "An object containing the received data as a JSON string is added to the object tree.": "Se agrega al árbol de objetos un objeto que contiene los datos recibidos como una cadena JSON.",
    "Group parameter data by received category": "Agrupar datos de parámetros por categoría recibida.",
    "The parameter data is grouped by the categories received.": "Los datos de los parámetros se agrupan por las categorías recibidas.",
    "Notifications": "Notificaciones",
    "Retrieve active notifications": "Recuperar notificaciones activas",
    "Active notifications will be retrieved and added to the object tree.": "Las notificaciones activas se recuperarán y agregarán al árbol de objetos.",
    "Add object with active notifications as raw JSON": "Agregar objeto con notificaciones activas como JSON sin formato",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Se agrega al árbol de objetos un objeto que contiene las notificaciones activas recibidas como una cadena JSON."
}
