{
    "myuplink adapter settings": "Adapterinstellingen voor myuplink",
    "Authentication": "Authenticatie",
    "Get it from https://dev.myuplink.com/apps": "Haal het op via https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Authorization Code Grant Flow gebruiken",
    "These and the following options are not required in most cases.": "Deze en de volgende opties zijn in de meeste gevallen niet vereist.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Hoeft niet te worden gewijzigd. U kunt https://sebilm.github.io/ioBroker.myuplink/myuplink.html gebruiken",
    "Click here to generate the Auth Code on myUplink.": "Klik hier om de Auth-Code op myUplink te genereren.",
    "Paste your Auth Code here.": "Plak hier je Auth Code.",
    "Settings": "Instellingen",
    "Refresh interval": "Vernieuwingsinterval",
    "Time in minutes of fetching data from myUplink.": "Tijd in minuten voor het ophalen van gegevens van myUplink.",
    "Language": "Taal",
    "English": "Engels",
    "German": "Duits",
    "Swedish": "Zweeds",
    "The language for naming the data objects.": "De taal voor het benoemen van de gegevensobjecten.",
    "Parameter data": "Parametergegevens",
    "Retrieve parameter data": "Parametergegevens ophalen",
    "Parameter data will be retrieved and added to the object tree.": "Parametergegevens worden opgehaald en toegevoegd aan de objectboom.",
    "Add object with the raw JSON data": "Voeg object toe met de onbewerkte JSON-gegevens",
    "An object containing the received data as a JSON string is added to the object tree.": "Een object dat de ontvangen gegevens als een JSON-string bevat, wordt aan de objectboom toegevoegd.",
    "Group parameter data by received category": "Groepeer parametergegevens op ontvangen categorie",
    "The parameter data is grouped by the categories received.": "De parametergegevens worden gegroepeerd op basis van de ontvangen categorieën.",
    "Notifications": "Meldingen",
    "Retrieve active notifications": "Haal actieve meldingen op",
    "Active notifications will be retrieved and added to the object tree.": "Actieve meldingen worden opgehaald en toegevoegd aan de objectboom.",
    "Add object with active notifications as raw JSON": "Voeg object met actieve meldingen toe als onbewerkte JSON",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Een object dat de ontvangen actieve meldingen bevat als een JSON-string, wordt toegevoegd aan de objectboom.",
    "General": "Algemeen",
    "Extended": "Verlengd"
}
