{
    "myuplink adapter settings": "Adaptereinstellungen für myuplink",
    "Authentication": "Authentifizierung",
    "Get it from https://dev.myuplink.com/apps": "Gibts auf https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Authorization Code Grant Flow verwenden",
    "These and the following options are not required in most cases.": "Diese und die folgenden Optionen werden in den meisten Fällen nicht benötigt.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Muss nicht geändert werden. Es kann https://sebilm.github.io/ioBroker.myuplink/myuplink.html verwendet werden.",
    "Click here to generate the Auth Code on myUplink.": "Hier klicken, um den Auth-Code auf myUplink zu generieren.",
    "Paste your Auth Code here.": "Den Auth-Code hier einfügen.",
    "Settings": "Einstellungen",
    "Refresh interval": "Aktualisierungsintervall",
    "Time in minutes of fetching data from myUplink.": "Zeit in Minuten für den Datenabruf von myUplink.",
    "Language": "Sprache",
    "English": "Englisch",
    "German": "Deutsch",
    "Swedish": "Schwedisch",
    "The language for naming the data objects.": "Die Sprache für die Benennung der Datenobjekte.",
    "Parameter data": "Parameter-Daten",
    "Retrieve parameter data": "Parameter-Daten abrufen",
    "Parameter data will be retrieved and added to the object tree.": "Parameter-Daten werden abgerufen und zum Objektbaum hinzugefügt.",
    "Add object with the raw JSON data": "Objekt mit den JSON-Rohdaten hinzufügen",
    "An object containing the received data as a JSON string is added to the object tree.": "Dem Objektbaum wird ein Objekt hinzugefügt, das die empfangenen Daten als JSON-String enthält.",
    "Group parameter data by received category": "Parameter-Daten nach empfangener Kategorie gruppieren",
    "The parameter data is grouped by the categories received.": "Die Parameter-Daten werden nach den empfangenen Kategorien gruppiert.",
    "Notifications": "Benachrichtigungen",
    "Retrieve active notifications": "Aktive Benachrichtigungen abrufen",
    "Active notifications will be retrieved and added to the object tree.": "Aktive Benachrichtigungen werden abgerufen und dem Objektbaum hinzugefügt.",
    "Add object with active notifications as raw JSON": "Objekt mit aktiven Benachrichtigungen als rohes JSON hinzufügen",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Dem Objektbaum wird ein Objekt hinzugefügt, das die empfangenen aktiven Benachrichtigungen als JSON-String enthält.",
    "General": "Allgemein",
    "Extended": "Erweitert"
}
