{
    "myuplink adapter settings": "Налаштування адаптера для myuplink",
    "Authentication": "Аутентифікація",
    "Get it from https://dev.myuplink.com/apps": "Отримайте його з https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Використовуйте Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "У більшості випадків ці та наступні параметри не потрібні.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Не потребує змін. Ви можете використовувати https://sebilm.github.io/ioBroker.myuplink/myuplink.html",
    "Click here to generate the Auth Code on myUplink.": "Натисніть тут, щоб згенерувати код авторизації на myUplink.",
    "Paste your Auth Code here.": "Вставте код доступу сюди.",
    "Settings": "Налаштування",
    "Refresh interval": "Інтервал оновлення",
    "Time in minutes of fetching data from myUplink.": "Час у хвилинах отримання даних із myUplink.",
    "Language": "Мова",
    "English": "англійська",
    "German": "Німецький",
    "Swedish": "шведська",
    "The language for naming the data objects.": "Мова іменування об’єктів даних.",
    "Parameter data": "Дані параметрів",
    "Retrieve parameter data": "Отримати дані параметрів",
    "Parameter data will be retrieved and added to the object tree.": "Дані параметрів будуть отримані та додані до дерева об’єктів.",
    "Add object with the raw JSON data": "Додайте об’єкт із необробленими даними JSON",
    "An object containing the received data as a JSON string is added to the object tree.": "До дерева об’єктів додається об’єкт, що містить отримані дані у вигляді рядка JSON.",
    "Group parameter data by received category": "Згрупуйте дані параметрів за отриманою категорією",
    "The parameter data is grouped by the categories received.": "Дані параметрів групуються за отриманими категоріями.",
    "Notifications": "Сповіщення",
    "Retrieve active notifications": "Отримати активні сповіщення",
    "Active notifications will be retrieved and added to the object tree.": "Активні сповіщення буде отримано та додано до дерева об’єктів.",
    "Add object with active notifications as raw JSON": "Додайте об’єкт із активними сповіщеннями як необроблений JSON",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "До дерева об’єктів додається об’єкт, що містить отримані активні сповіщення у вигляді рядка JSON."
}
