{
    "myuplink adapter settings": "Ustawienia adaptera dla myuplink",
    "Authentication": "Uwierzytelnianie",
    "Get it from https://dev.myuplink.com/apps": "Pobierz go z https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Użyj ACG Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "W większości przypadków te i poniższe opcje nie są wymagane.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Nie trzeba zmieniać. Możesz użyć https://sebilm.github.io/ioBroker.myuplink/myuplink.html",
    "Click here to generate the Auth Code on myUplink.": "Kliknij tutaj, aby wygenerować Auth Code na myUplink.",
    "Paste your Auth Code here.": "Wklej tutaj swój Auth Code.",
    "Settings": "Ustawienia",
    "Refresh interval": "Częstotliwość odświeżania",
    "Time in minutes of fetching data from myUplink.": "Czas w minutach pobierania danych z myUplink.",
    "Language": "Język",
    "English": "język angielski",
    "German": "Niemiecki",
    "Swedish": "szwedzki",
    "The language for naming the data objects.": "Język nazewnictwa obiektów danych.",
    "Parameter data": "Dane parametrów",
    "Retrieve parameter data": "Pobierz dane parametrów",
    "Parameter data will be retrieved and added to the object tree.": "Dane parametrów zostaną pobrane i dodane do drzewa obiektów.",
    "Add object with the raw JSON data": "Dodaj obiekt z surowymi danymi JSON",
    "An object containing the received data as a JSON string is added to the object tree.": "Do drzewa obiektów dodawany jest obiekt zawierający odebrane dane w postaci ciągu JSON.",
    "Group parameter data by received category": "Grupuj dane parametrów według otrzymanych kategorii",
    "The parameter data is grouped by the categories received.": "Dane parametrów są pogrupowane według otrzymanych kategorii.",
    "Notifications": "Powiadomienia",
    "Retrieve active notifications": "Pobierz aktywne powiadomienia",
    "Active notifications will be retrieved and added to the object tree.": "Aktywne powiadomienia zostaną pobrane i dodane do drzewa obiektów.",
    "Add object with active notifications as raw JSON": "Dodaj obiekt z aktywnymi powiadomieniami jako surowy JSON",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Do drzewa obiektów dodawany jest obiekt zawierający odebrane aktywne powiadomienia w postaci ciągu JSON."
}
