{
    "myuplink adapter settings": "Настройки адаптера для myuplink",
    "Authentication": "Аутентификация",
    "Get it from https://dev.myuplink.com/apps": "Загрузите его с https://dev.myuplink.com/apps.",
    "Use Authorization Code Grant Flow": "Используйте Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "Эти и следующие параметры не требуются в большинстве случаев.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Менять не нужно. Вы можете использовать https://sebilm.github.io/ioBroker.myuplink/myuplink.html.",
    "Click here to generate the Auth Code on myUplink.": "Нажмите здесь, чтобы сгенерировать Auth-код на myUplink.",
    "Paste your Auth Code here.": "Вставьте сюда свой код авторизации.",
    "Settings": "Настройки",
    "Refresh interval": "Интервал обновления",
    "Time in minutes of fetching data from myUplink.": "Время в минутах получения данных из myUplink.",
    "Language": "Язык",
    "English": "Английский",
    "German": "Немецкий",
    "Swedish": "Шведский",
    "The language for naming the data objects.": "Язык именования объектов данных.",
    "Parameter data": "Данные параметров",
    "Retrieve parameter data": "Получить данные параметров",
    "Parameter data will be retrieved and added to the object tree.": "Данные параметров будут получены и добавлены в дерево объектов.",
    "Add object with the raw JSON data": "Добавьте объект с необработанными данными JSON.",
    "An object containing the received data as a JSON string is added to the object tree.": "В дерево объектов добавляется объект, содержащий полученные данные в виде строки JSON.",
    "Group parameter data by received category": "Группировать данные параметров по полученной категории",
    "The parameter data is grouped by the categories received.": "Данные параметров сгруппированы по полученным категориям.",
    "Notifications": "Уведомления",
    "Retrieve active notifications": "Получение активных уведомлений",
    "Active notifications will be retrieved and added to the object tree.": "Активные уведомления будут получены и добавлены в дерево объектов.",
    "Add object with active notifications as raw JSON": "Добавить объект с активными уведомлениями в виде необработанного JSON.",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "В дерево объектов добавляется объект, содержащий полученные активные уведомления в виде строки JSON.",
    "General": "Общий",
    "Extended": "Расширенный",
    "Rename IDs": "Переименование идентификаторов",
    "Object IDs in the object tree are specified by the myuplink API. However, these can be renamed with these options by specifying the ID of the API (original ID) and a new ID. If objects with the original ID already exist in the object tree, they must be deleted manually - these objects will not be updated!": "Идентификаторы объектов в дереве объектов задаются API myuplink. Однако их можно переименовать с помощью этих параметров, указав идентификатор API (исходный идентификатор) и новый идентификатор. Если в дереве объектов уже существуют объекты с исходным идентификатором, их необходимо удалить вручную — эти объекты не будут обновляться!",
    "Systems": "Системы",
    "Original ID": "Исходный идентификатор",
    "New ID": "Новый идентификатор",
    "Devices": "Устройства",
    "Categories": "Категории",
    "Parameter Data IDs": "Идентификаторы данных параметров",
    "A Parameter data ID can also be assigned to a category here. A folder is created for this category. The category sent by the API is then ignored.": "Здесь также можно присвоить категории идентификатор данных параметра. Для этой категории создается папка. Категория, отправленная API, затем игнорируется.",
    "Identifiers and categories for a few heat pumps can be downloaded here and imported into the table.": "Идентификаторы и категории для некоторых тепловых насосов можно скачать здесь и импортировать в таблицу."
}
