{
    "myuplink adapter settings": "Настройки адаптера для myuplink",
    "Authentication": "Аутентификация",
    "Get it from https://dev.myuplink.com/apps": "Загрузите его с https://dev.myuplink.com/apps.",
    "Use Authorization Code Grant Flow": "Используйте Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "Эти и следующие параметры не требуются в большинстве случаев.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Менять не нужно. Вы можете использовать https://sebilm.github.io/ioBroker.myuplink/myuplink.html.",
    "Click here to generate the Auth Code on myUplink.": "Нажмите здесь, чтобы сгенерировать Auth-код на myUplink.",
    "Paste your Auth Code here.": "Вставьте сюда свой код авторизации.",
    "Settings": "Настройки",
    "Refresh interval": "Интервал обновления",
    "Time in minutes of fetching data from myUplink.": "Время в минутах получения данных из myUplink.",
    "Language": "Язык",
    "English": "Английский",
    "German": "Немецкий",
    "Swedish": "Шведский",
    "The language for naming the data objects.": "Язык именования объектов данных.",
    "Parameter data": "Данные параметров",
    "Retrieve parameter data": "Получить данные параметров",
    "Parameter data will be retrieved and added to the object tree.": "Данные параметров будут получены и добавлены в дерево объектов.",
    "Add object with the raw JSON data": "Добавьте объект с необработанными данными JSON.",
    "An object containing the received data as a JSON string is added to the object tree.": "В дерево объектов добавляется объект, содержащий полученные данные в виде строки JSON.",
    "Group parameter data by received category": "Группировать данные параметров по полученной категории",
    "The parameter data is grouped by the categories received.": "Данные параметров сгруппированы по полученным категориям.",
    "Notifications": "Уведомления",
    "Retrieve active notifications": "Получение активных уведомлений",
    "Active notifications will be retrieved and added to the object tree.": "Активные уведомления будут получены и добавлены в дерево объектов.",
    "Add object with active notifications as raw JSON": "Добавить объект с активными уведомлениями в виде необработанного JSON.",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "В дерево объектов добавляется объект, содержащий полученные активные уведомления в виде строки JSON.",
    "General": "Общий",
    "Extended": "Расширенный"
}
