{
    "myuplink adapter settings": "Configurações do adaptador para myuplink",
    "Authentication": "Autenticação",
    "Get it from https://dev.myuplink.com/apps": "Obtenha-o em https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Utilizar Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "Estas e as seguintes opções não são necessárias na maioria dos casos.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Não precisa ser alterado. Você pode usar https://sebilm.github.io/ioBroker.myuplink/myuplink.html",
    "Click here to generate the Auth Code on myUplink.": "Clique aqui para gerar o código de autenticação no myUplink.",
    "Paste your Auth Code here.": "Cole o seu código de autenticação aqui.",
    "Settings": "Configurações",
    "Refresh interval": "Intervalo de atualização",
    "Time in minutes of fetching data from myUplink.": "Tempo em minutos de busca de dados do myUplink.",
    "Language": "Linguagem",
    "English": "Inglês",
    "German": "Alemão",
    "Swedish": "sueco",
    "The language for naming the data objects.": "A linguagem para nomear os objetos de dados.",
    "Parameter data": "Dados de parâmetro",
    "Retrieve parameter data": "Recuperar dados de parâmetros",
    "Parameter data will be retrieved and added to the object tree.": "Os dados dos parâmetros serão recuperados e adicionados à árvore de objetos.",
    "Add object with the raw JSON data": "Adicionar objeto com os dados JSON brutos",
    "An object containing the received data as a JSON string is added to the object tree.": "Um objeto contendo os dados recebidos como uma string JSON é adicionado à árvore de objetos.",
    "Group parameter data by received category": "Agrupar dados de parâmetros por categoria recebida",
    "The parameter data is grouped by the categories received.": "Os dados dos parâmetros são agrupados pelas categorias recebidas.",
    "Notifications": "Notificações",
    "Retrieve active notifications": "Recuperar notificações ativas",
    "Active notifications will be retrieved and added to the object tree.": "As notificações ativas serão recuperadas e adicionadas à árvore de objetos.",
    "Add object with active notifications as raw JSON": "Adicionar objeto com notificações ativas como JSON bruto",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Um objeto contendo as notificações ativas recebidas como uma sequência JSON é adicionado à árvore de objetos.",
    "General": "Em geral",
    "Extended": "Estendido",
    "Rename IDs": "Renomear IDs",
    "Object IDs in the object tree are specified by the myuplink API. However, these can be renamed with these options by specifying the ID of the API (original ID) and a new ID. If objects with the original ID already exist in the object tree, they must be deleted manually - these objects will not be updated!": "Os IDs de objeto na árvore de objetos são especificados pela API myuplink. No entanto, estes podem ser renomeados com estas opções especificando o ID da API (ID original) e um novo ID. Se já existirem objetos com o ID original na árvore de objetos, eles deverão ser excluídos manualmente - esses objetos não serão atualizados!",
    "Systems": "Sistemas",
    "Original ID": "ID original",
    "New ID": "Novo ID",
    "Devices": "Dispositivos",
    "Categories": "Categorias",
    "Parameter Data IDs": "IDs de dados de parâmetro",
    "A Patameter data ID can also be assigned to a category here. A folder is created for this category. The category sent by the API is then ignored.": "Um ID de dados Patameter também pode ser atribuído a uma categoria aqui. Uma pasta é criada para esta categoria. A categoria enviada pela API é então ignorada."
}
