{
    "myuplink adapter settings": "Impostazioni dell'adattatore per myuplink",
    "Authentication": "Autenticazione",
    "Get it from https://dev.myuplink.com/apps": "Ottienilo da https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Utilizzare Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "Nella maggior parte dei casi, queste e le seguenti opzioni non sono necessarie.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "Non è necessario cambiarlo. Puoi usare https://sebilm.github.io/ioBroker.myuplink/myuplink.html",
    "Click here to generate the Auth Code on myUplink.": "Fare clic qui per generare il codice di autorizzazione su myUplink.",
    "Paste your Auth Code here.": "Incollare qui il codice di autorizzazione.",
    "Settings": "Impostazioni",
    "Refresh interval": "Intervallo di aggiornamento",
    "Time in minutes of fetching data from myUplink.": "Tempo in minuti di recupero dei dati da myUplink.",
    "Language": "Lingua",
    "English": "Inglese",
    "German": "Tedesco",
    "Swedish": "svedese",
    "The language for naming the data objects.": "La lingua per denominare gli oggetti dati.",
    "Parameter data": "Dati dei parametri",
    "Retrieve parameter data": "Recuperare i dati dei parametri",
    "Parameter data will be retrieved and added to the object tree.": "I dati dei parametri verranno recuperati e aggiunti all'albero degli oggetti.",
    "Add object with the raw JSON data": "Aggiungi oggetto con i dati JSON grezzi",
    "An object containing the received data as a JSON string is added to the object tree.": "Un oggetto contenente i dati ricevuti come stringa JSON viene aggiunto all'albero degli oggetti.",
    "Group parameter data by received category": "Raggruppare i dati dei parametri per categoria ricevuta",
    "The parameter data is grouped by the categories received.": "I dati dei parametri sono raggruppati in base alle categorie ricevute.",
    "Notifications": "Notifiche",
    "Retrieve active notifications": "Recupera le notifiche attive",
    "Active notifications will be retrieved and added to the object tree.": "Le notifiche attive verranno recuperate e aggiunte all'albero degli oggetti.",
    "Add object with active notifications as raw JSON": "Aggiungi oggetto con notifiche attive come JSON non elaborato",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Un oggetto contenente le notifiche attive ricevute come stringa JSON viene aggiunto all'albero degli oggetti.",
    "General": "Generale",
    "Extended": "Esteso",
    "Rename IDs": "Rinominare gli ID",
    "Object IDs in the object tree are specified by the myuplink API. However, these can be renamed with these options by specifying the ID of the API (original ID) and a new ID. If objects with the original ID already exist in the object tree, they must be deleted manually - these objects will not be updated!": "Gli ID oggetto nell'albero degli oggetti sono specificati dall'API myuplink. Questi però possono essere rinominati con queste opzioni specificando l'ID dell'API (ID originale) ed un nuovo ID. Se nell'albero degli oggetti esistono già oggetti con l'ID originale, è necessario eliminarli manualmente: questi oggetti non verranno aggiornati!",
    "Systems": "Sistemi",
    "Original ID": "Identificativo originale",
    "New ID": "Nuova identità",
    "Devices": "Dispositivi",
    "Categories": "Categorie",
    "Parameter Data IDs": "ID dati parametro",
    "A Patameter data ID can also be assigned to a category here. A folder is created for this category. The category sent by the API is then ignored.": "Qui è anche possibile assegnare un ID dati Patameter a una categoria. Viene creata una cartella per questa categoria. La categoria inviata dall'API viene quindi ignorata."
}
