{
    "myuplink adapter settings": "Paramètres d'adaptateur pour myuplink",
    "Authentication": "Authentification",
    "Get it from https://dev.myuplink.com/apps": "Obtenez-le sur https://dev.myuplink.com/apps",
    "Use Authorization Code Grant Flow": "Utiliser Authorization Code Grant Flow",
    "These and the following options are not required in most cases.": "Ces options et les suivantes ne sont pas requises dans la plupart des cas.",
    "Does not need to be changed. You can use https://sebilm.github.io/ioBroker.myuplink/myuplink.html": "N'a pas besoin d'être modifié. Vous pouvez utiliser https://sebilm.github.io/ioBroker.myuplink/myuplink.html",
    "Click here to generate the Auth Code on myUplink.": "Cliquez ici pour générer le code d'authentification sur myUplink.",
    "Paste your Auth Code here.": "Collez votre code d'authentification ici.",
    "Settings": "Paramètres",
    "Refresh interval": "Intervalle de rafraîchissement",
    "Time in minutes of fetching data from myUplink.": "Temps en minutes de récupération des données depuis myUplink.",
    "Language": "Langue",
    "English": "Anglais",
    "German": "Allemand",
    "Swedish": "suédois",
    "The language for naming the data objects.": "Le langage pour nommer les objets de données.",
    "Parameter data": "Données de paramètres",
    "Retrieve parameter data": "Récupérer les données des paramètres",
    "Parameter data will be retrieved and added to the object tree.": "Les données de paramètres seront récupérées et ajoutées à l’arborescence des objets.",
    "Add object with the raw JSON data": "Ajouter un objet avec les données JSON brutes",
    "An object containing the received data as a JSON string is added to the object tree.": "Un objet contenant les données reçues sous forme de chaîne JSON est ajouté à l'arborescence des objets.",
    "Group parameter data by received category": "Regrouper les données de paramètres par catégorie reçue",
    "The parameter data is grouped by the categories received.": "Les données de paramètres sont regroupées par catégories reçues.",
    "Notifications": "Notifications",
    "Retrieve active notifications": "Récupérer les notifications actives",
    "Active notifications will be retrieved and added to the object tree.": "Les notifications actives seront récupérées et ajoutées à l’arborescence des objets.",
    "Add object with active notifications as raw JSON": "Ajouter un objet avec des notifications actives sous forme de JSON brut",
    "An object containing the received active notifications as a JSON string is added to the object tree.": "Un objet contenant les notifications actives reçues sous forme de chaîne JSON est ajouté à l'arborescence des objets.",
    "General": "Général",
    "Extended": "Étendu"
}
